In [1]:
import pandas as pd 
import numpy as np
import csv

In [2]:
#barcelona_listings = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/barcelona_listings.csv")
barcelona_calendar = pd.read_csv("barcelona_calendar.csv")
#barcelona_reviews = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/barcelona_reviews.csv")

#madrid_listings = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/madrid_listings_filtered.csv")
madrid_calendar = pd.read_csv("madrid_calendar.csv")
#madrid_reviews = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/madrid_reviews.csv")

#berlin_listings = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/berlin_listings_filtered.csv")
berlin_calendar = pd.read_csv("berlin_calendar.csv")
#berlin_reviews = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/berlin_reviews.csv")

#countries = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/Countries.csv")
#cities = pd.read_csv("C:/Users/loris/OneDrive/EPFL/2018-19/databaseSystems/project/database/Cities.csv")

In [3]:
tab_calendar = pd.concat([barcelona_calendar, madrid_calendar,berlin_calendar])
print(tab_calendar.count())
tab_calendar.head()

listing_id    15364310
date          15364310
available     15364310
price          6093473
dtype: int64

   listing_id        date available   price
0       74562  2019-11-06         t  $60.00
1       74562  2019-11-05         t  $60.00
2       74562  2019-11-04         t  $60.00
3       74562  2019-11-03         t  $60.00
4       74562  2019-11-02         t  $65.00

In [4]:
tab_calendar.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [5]:
##change price type
print(type(tab_calendar['price'].iloc[0]))
price = tab_calendar['price']

<class 'str'>

In [6]:
price.head()

0    $60.00
1    $60.00
2    $60.00
3    $60.00
4    $65.00
Name: price, dtype: object

In [7]:
price = price.apply(lambda x: float(str(x).replace('$', '').replace(',', '')))
price.head()

0    60.0
1    60.0
2    60.0
3    60.0
4    65.0
Name: price, dtype: float64

In [8]:
print(type(price.iloc[0]))
print(price.max())

<class 'numpy.float64'>
11420.0

In [9]:
tab_calendar['price'] = price
print(type(tab_calendar['price'].iloc[0]))

<class 'numpy.float64'>

In [10]:
tab_calendar = tab_calendar.sort_values(by=['listing_id'])
print(tab_calendar.count())
tab_calendar.head()

listing_id    15364310
date          15364310
available     15364310
price          6093473
dtype: int64

     listing_id        date available  price
0          2015  2019-09-10         f    NaN
249        2015  2019-01-04         t   76.0
248        2015  2019-01-05         t   76.0
247        2015  2019-01-06         t   76.0
246        2015  2019-01-07         t   76.0

In [11]:
tab_calendar = tab_calendar.rename(index=str, columns={"listing_id": "LISTING_ID", "date": "DATE_CALENDAR", "available": "AVAILABLE", "price": "PRICE"})
tab_calendar = tab_calendar[['DATE_CALENDAR', 'AVAILABLE', 'PRICE', 'LISTING_ID']]
tab_calendar.head()

    DATE_CALENDAR AVAILABLE  PRICE  LISTING_ID
0      2019-09-10         f    NaN        2015
249    2019-01-04         t   76.0        2015
248    2019-01-05         t   76.0        2015
247    2019-01-06         t   76.0        2015
246    2019-01-07         t   76.0        2015

In [12]:
tab_calendar.to_csv(r'calendar.csv', index = False, encoding='utf-8')